; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-32)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 - package
    l1 l2 l3 l4 l5 l6 l7 l8 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l5)
    (at p3 l2)
    (at p4 l8)
    (at p5 l7)
    (at p6 l4)
    (at v1 l8)
    (at v2 l2)
    (at v3 l1)
    (at v4 l5)
    (road l7 l4)
    (road l6 l2)
    (road l8 l4)
    (road l1 l5)
    (road l4 l6)
    (road l6 l4)
    (road l5 l1)
    (road l6 l3)
    (road l2 l6)
    (road l4 l8)
    (road l3 l6)
    (road l2 l5)
    (road l4 l7)
    (road l5 l2)
    (road l1 l3)
    (road l3 l1)
    (road l1 l8)
    (road l8 l1)
    (road l5 l6)
    (road l6 l5)
    (road l2 l3)
    (road l3 l2)
    (road l5 l8)
    (road l8 l5)
    (road l2 l7)
    (road l7 l2)
    )
 (:goal (and 
(at p1 l4)
(at p2 l3)
(at p3 l3)
))
)

; plan
1. (pick-up v4 l5 p2 c0 c1)
   deleted: (at p2 l5) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 0 of 3
2. (pick-up v2 l2 p3 c0 c1)
   deleted: (at p3 l2) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 0 of 3
3. (pick-up v1 l8 p1 c1 c2)
   deleted: (at p1 l8) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 3
4. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 0 of 3
5. (drop v1 l4 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l4) (capacity v1 c2)
   goals met: 1 of 3
6. (drive v4 l5 l1)
   deleted: (at v4 l5)
   added: (at v4 l1)
   goals met: 1 of 3
7. (drive v4 l1 l3)
   deleted: (at v4 l1)
   added: (at v4 l3)
   goals met: 1 of 3
8. (drop v4 l3 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l3) (capacity v4 c1)
   goals met: 2 of 3
9. (drive v2 l2 l3)
   deleted: (at v2 l2)
   added: (at v2 l3)
   goals met: 2 of 3
10. (drop v2 l3 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l3) (capacity v2 c1)
   goals met: 3 of 3
